sterentev/atdf-device-asm-include/inc/ATmega329PA.inc
; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable

; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag



; ====	LCD MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register LCDDR18 bits		------------------------
.equ	SEG324		= 0		; 0x01 - LCD memory bit segment
.equ	SEG325		= 1		; 0x02 - LCD memory bit segment
.equ	SEG326		= 2		; 0x04 - LCD memory bit segment
.equ	SEG327		= 3		; 0x08 - LCD memory bit segment
.equ	SEG328		= 4		; 0x10 - LCD memory bit segment
.equ	SEG329		= 5		; 0x20 - LCD memory bit segment
.equ	SEG330		= 6		; 0x40 - LCD memory bit segment
.equ	SEG331		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR17 bits		------------------------
.equ	SEG316		= 0		; 0x01 - LCD memory bit segment
.equ	SEG317		= 1		; 0x02 - LCD memory bit segment
.equ	SEG318		= 2		; 0x04 - LCD memory bit segment
.equ	SEG319		= 3		; 0x08 - LCD memory bit segment
.equ	SEG320		= 4		; 0x10 - LCD memory bit segment
.equ	SEG321		= 5		; 0x20 - LCD memory bit segment
.equ	SEG322		= 6		; 0x40 - LCD memory bit segment
.equ	SEG323		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR16 bits		------------------------
.equ	SEG308		= 0		; 0x01 - LCD memory bit segment
.equ	SEG309		= 1		; 0x02 - LCD memory bit segment
.equ	SEG310		= 2		; 0x04 - LCD memory bit segment
.equ	SEG311		= 3		; 0x08 - LCD memory bit segment
.equ	SEG312		= 4		; 0x10 - LCD memory bit segment
.equ	SEG313		= 5		; 0x20 - LCD memory bit segment
.equ	SEG314		= 6		; 0x40 - LCD memory bit segment
.equ	SEG315		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR15 bits		------------------------
.equ	SEG300		= 0		; 0x01 - LCD memory bit segment
.equ	SEG301		= 1		; 0x02 - LCD memory bit segment
.equ	SEG302		= 2		; 0x04 - LCD memory bit segment
.equ	SEG303		= 3		; 0x08 - LCD memory bit segment
.equ	SEG304		= 4		; 0x10 - LCD memory bit segment
.equ	SEG305		= 5		; 0x20 - LCD memory bit segment
.equ	SEG306		= 6		; 0x40 - LCD memory bit segment
.equ	SEG307		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR13 bits		------------------------
.equ	SEG224		= 0		; 0x01 - LCD memory bit segment
.equ	SEG225		= 1		; 0x02 - LCD memory bit segment
.equ	SEG226		= 2		; 0x04 - LCD memory bit segment
.equ	SEG227		= 3		; 0x08 - LCD memory bit segment
.equ	SEG228		= 4		; 0x10 - LCD memory bit segment
.equ	SEG229		= 5		; 0x20 - LCD memory bit segment
.equ	SEG230		= 6		; 0x40 - LCD memory bit segment
.equ	SEG231		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR12 bits		------------------------
.equ	SEG216		= 0		; 0x01 - LCD memory bit segment
.equ	SEG217		= 1		; 0x02 - LCD memory bit segment
.equ	SEG218		= 2		; 0x04 - LCD memory bit segment
.equ	SEG219		= 3		; 0x08 - LCD memory bit segment
.equ	SEG220		= 4		; 0x10 - LCD memory bit segment
.equ	SEG221		= 5		; 0x20 - LCD memory bit segment
.equ	SEG222		= 6		; 0x40 - LCD memory bit segment
.equ	SEG223		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR11 bits		------------------------
.equ	SEG208		= 0		; 0x01 - LCD memory bit segment
.equ	SEG209		= 1		; 0x02 - LCD memory bit segment
.equ	SEG210		= 2		; 0x04 - LCD memory bit segment
.equ	SEG211		= 3		; 0x08 - LCD memory bit segment
.equ	SEG212		= 4		; 0x10 - LCD memory bit segment
.equ	SEG213		= 5		; 0x20 - LCD memory bit segment
.equ	SEG214		= 6		; 0x40 - LCD memory bit segment
.equ	SEG215		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR10 bits		------------------------
.equ	SEG200		= 0		; 0x01 - LCD memory bit segment
.equ	SEG201		= 1		; 0x02 - LCD memory bit segment
.equ	SEG202		= 2		; 0x04 - LCD memory bit segment
.equ	SEG203		= 3		; 0x08 - LCD memory bit segment
.equ	SEG204		= 4		; 0x10 - LCD memory bit segment
.equ	SEG205		= 5		; 0x20 - LCD memory bit segment
.equ	SEG206		= 6		; 0x40 - LCD memory bit segment
.equ	SEG207		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR08 bits		------------------------
.equ	SEG124		= 0		; 0x01 - LCD memory bit segment
.equ	SEG125		= 1		; 0x02 - LCD memory bit segment
.equ	SEG126		= 2		; 0x04 - LCD memory bit segment
.equ	SEG127		= 3		; 0x08 - LCD memory bit segment
.equ	SEG128		= 4		; 0x10 - LCD memory bit segment
.equ	SEG129		= 5		; 0x20 - LCD memory bit segment
.equ	SEG130		= 6		; 0x40 - LCD memory bit segment
.equ	SEG131		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR07 bits		------------------------
.equ	SEG116		= 0		; 0x01 - LCD memory bit segment
.equ	SEG117		= 1		; 0x02 - LCD memory bit segment
.equ	SEG118		= 2		; 0x04 - LCD memory bit segment
.equ	SEG119		= 3		; 0x08 - LCD memory bit segment
.equ	SEG120		= 4		; 0x10 - LCD memory bit segment
.equ	SEG121		= 5		; 0x20 - LCD memory bit segment
.equ	SEG122		= 6		; 0x40 - LCD memory bit segment
.equ	SEG123		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR06 bits		------------------------
.equ	SEG108		= 0		; 0x01 - LCD memory bit segment
.equ	SEG109		= 1		; 0x02 - LCD memory bit segment
.equ	SEG110		= 2		; 0x04 - LCD memory bit segment
.equ	SEG111		= 3		; 0x08 - LCD memory bit segment
.equ	SEG112		= 4		; 0x10 - LCD memory bit segment
.equ	SEG113		= 5		; 0x20 - LCD memory bit segment
.equ	SEG114		= 6		; 0x40 - LCD memory bit segment
.equ	SEG115		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR05 bits		------------------------
.equ	SEG100		= 0		; 0x01 - LCD memory bit segment
.equ	SEG101		= 1		; 0x02 - LCD memory bit segment
.equ	SEG102		= 2		; 0x04 - LCD memory bit segment
.equ	SEG103		= 3		; 0x08 - LCD memory bit segment
.equ	SEG104		= 4		; 0x10 - LCD memory bit segment
.equ	SEG105		= 5		; 0x20 - LCD memory bit segment
.equ	SEG106		= 6		; 0x40 - LCD memory bit segment
.equ	SEG107		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR03 bits		------------------------
.equ	SEG024		= 0		; 0x01 - LCD memory bit segment
.equ	SEG025		= 1		; 0x02 - LCD memory bit segment
.equ	SEG026		= 2		; 0x04 - LCD memory bit segment
.equ	SEG027		= 3		; 0x08 - LCD memory bit segment
.equ	SEG028		= 4		; 0x10 - LCD memory bit segment
.equ	SEG029		= 5		; 0x20 - LCD memory bit segment
.equ	SEG030		= 6		; 0x40 - LCD memory bit segment
.equ	SEG031		= 7		; 0x80 - LCD memory bit segment

