sterentev/atdf-device-asm-include/inc/ATmega329PA.inc
; ----------	Register LCDDR02 bits		------------------------
.equ	SEG016		= 0		; 0x01 - LCD memory bit segment
.equ	SEG017		= 1		; 0x02 - LCD memory bit segment
.equ	SEG018		= 2		; 0x04 - LCD memory bit segment
.equ	SEG019		= 3		; 0x08 - LCD memory bit segment
.equ	SEG020		= 4		; 0x10 - LCD memory bit segment
.equ	SEG021		= 5		; 0x20 - LCD memory bit segment
.equ	SEG022		= 6		; 0x40 - LCD memory bit segment
.equ	SEG023		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR01 bits		------------------------
.equ	SEG008		= 0		; 0x01 - LCD memory bit segment
.equ	SEG009		= 1		; 0x02 - LCD memory bit segment
.equ	SEG010		= 2		; 0x04 - LCD memory bit segment
.equ	SEG011		= 3		; 0x08 - LCD memory bit segment
.equ	SEG012		= 4		; 0x10 - LCD memory bit segment
.equ	SEG013		= 5		; 0x20 - LCD memory bit segment
.equ	SEG014		= 6		; 0x40 - LCD memory bit segment
.equ	SEG015		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR00 bits		------------------------
.equ	SEG000		= 0		; 0x01 - LCD memory bit segment
.equ	SEG001		= 1		; 0x02 - LCD memory bit segment
.equ	SEG002		= 2		; 0x04 - LCD memory bit segment
.equ	SEG003		= 3		; 0x08 - LCD memory bit segment
.equ	SEG004		= 4		; 0x10 - LCD memory bit segment
.equ	SEG005		= 5		; 0x20 - LCD memory bit segment
.equ	SEG006		= 6		; 0x40 - LCD memory bit segment
.equ	SEG007		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDCCR bits		------------------------
.equ	LCDDC_MASK	= 0xE0		;      - LCD Display Configuration (3 bits)
.equ	LCDDC0		= 5		;          LCDDC BIT0 position
.equ	LCDMDT		= 4		; 0x10 - LCD Maximum Drive Time
.equ	LCDCC_MASK	= 0x0F		;      - LCD Contrast Controls (4 bits)
.equ	LCDCC0		= 0		;          LCDCC BIT0 position
; ::::  LCDDC	:::: bitfield values
;			0x00		; 300us
;			0x20		; 70us
;			0x40		; 150us
;			0x60		; 450us
;			0x80		; 575us
;			0xA0		; 850us
;			0xC0		; 1150us
;			0xE0		; 50% of LCD clock
; ::::  LCDCC	:::: bitfield values
;			0x00		; 2.60V
;			0x01		; 2.65V
;			0x02		; 2.70V
;			0x03		; 2.75V
;			0x04		; 2.80V
;			0x05		; 2.85V
;			0x06		; 2.90V
;			0x07		; 2.95V
;			0x08		; 3.00V
;			0x09		; 3.05V
;			0x0A		; 3.10V
;			0x0B		; 3.15V
;			0x0C		; 3.20V
;			0x0D		; 3.25V
;			0x0E		; 3.30V
;			0x0F		; 3.35V

; ----------	Register LCDFRR bits		------------------------
.equ	LCDPS_MASK	= 0x70		;      - LCD Prescaler Selects (3 bits)
.equ	LCDPS0		= 4		;          LCDPS BIT0 position
.equ	LCDCD_MASK	= 0x07		;      - LCD Clock Dividers (3 bits)
.equ	LCDCD0		= 0		;          LCDCD BIT0 position
; ::::  LCDPS	:::: bitfield values
;			0x00		; ClkLCD/16
;			0x10		; ClkLCD/64
;			0x20		; ClkLCD/128
;			0x30		; ClkLCD/256
;			0x40		; ClkLCD/512
;			0x50		; ClkLCD/1024
;			0x60		; ClkLCD/2048
;			0x70		; ClkLCD/4096
; ::::  LCDCD	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 3
;			0x03		; 4
;			0x04		; 5
;			0x05		; 6
;			0x06		; 7
;			0x07		; 8

; ----------	Register LCDCRB bits		------------------------
.equ	LCDCS		= 7		; 0x80 - LCD CLock Select
.equ	LCD2B		= 6		; 0x40 - LCD 1/2 Bias Select
.equ	LCDMUX_MASK	= 0x30		;      - LCD Mux Selects (2 bits)
.equ	LCDMUX0		= 4		;          LCDMUX BIT0 position
.equ	LCDPM_MASK	= 0x0F		;      - LCD Port Masks (4 bits)
.equ	LCDPM0		= 0		;          LCDPM BIT0 position
; ::::  LCDPM	:::: bitfield values
;			0x00		; SEG0:12
;			0x01		; SEG0:14
;			0x02		; SEG0:15
;			0x03		; SEG0:18
;			0x04		; SEG0:20
;			0x05		; SEG0:22
;			0x06		; SEG0:23
;			0x07		; SEG0:24
;			0x08		; SEG0:26
;			0x09		; SEG0:28
;			0x0A		; SEG0:30
;			0x0B		; SEG0:32
;			0x0C		; SEG0:34
;			0x0D		; SEG0:36
;			0x0E		; SEG0:38
;			0x0F		; SEG0:39

; ----------	Register LCDCRA bits		------------------------
.equ	LCDEN		= 7		; 0x80 - LCD Enable
.equ	LCDAB		= 6		; 0x40 - LCD A or B waveform
.equ	LCDIF		= 4		; 0x10 - LCD Interrupt Flag
.equ	LCDIE		= 3		; 0x08 - LCD Interrupt Enable
.equ	LCDBD		= 2		; 0x04 - LCD Buffer Disable
.equ	LCDCCD		= 1		; 0x02 - LCD Contrast Control Disable
.equ	LCDBL		= 0		; 0x01 - LCD Blanking



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC01		= 1		; 0x02 - External Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - External Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register EIMSK bits		------------------------
.equ	PCIE_MASK	= 0xF0		;      - Pin Change Interrupt Enables (4 bits)
.equ	PCIE0		= 4		;          PCIE BIT0 position
.equ	INT0		= 0		; 0x01 - External Interrupt Request 0 Enable

; ----------	Register EIFR bits		------------------------
.equ	PCIF_MASK	= 0xF0		;      - Pin Change Interrupt Flags (4 bits)
.equ	PCIF0		= 4		;          PCIF BIT0 position
.equ	INTF0		= 0		; 0x01 - External Interrupt Flag 0

; ----------	Register PCMSK1 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Mask (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	BODS		= 6		; 0x40 - BOD Sleep
.equ	BODSE		= 5		; 0x20 - BOD Sleep Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
;.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register PRR bits		------------------------
.equ	PRLCD		= 4		; 0x10 - Power Reduction LCD
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Reserved



; ====	USI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register USISR bits		------------------------
.equ	USISIF		= 7		; 0x80 - Start Condition Interrupt Flag
.equ	USIOIF		= 6		; 0x40 - Counter Overflow Interrupt Flag
.equ	USIPF		= 5		; 0x20 - Stop Condition Flag
.equ	USIDC		= 4		; 0x10 - Data Output Collision
.equ	USICNT_MASK	= 0x0F		;      - USI Counter Value Bits (4 bits)
.equ	USICNT0		= 0		;          USICNT BIT0 position

; ----------	Register USICR bits		------------------------
.equ	USISIE		= 7		; 0x80 - Start Condition Interrupt Enable
.equ	USIOIE		= 6		; 0x40 - Counter Overflow Interrupt Enable
.equ	USIWM_MASK	= 0x30		;      - USI Wire Mode Bits (2 bits)
.equ	USIWM0		= 4		;          USIWM BIT0 position
.equ	USICS_MASK	= 0x0C		;      - USI Clock Source Select Bits (2 bits)
.equ	USICS0		= 2		;          USICS BIT0 position
.equ	USICLK		= 1		; 0x02 - Clock Strobe
.equ	USITC		= 0		; 0x01 - Toggle Clock Port Pin
; ::::  USIWM	:::: bitfield values
;			0x00		; Normal Operation
;			0x10		; Three-Wire Mode
;			0x20		; Two-Wire Mode
;			0x30		; Two-Wire Mode Held Low



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Reserved
;			0xC0		; Internal 1.1V Voltage Reference with external capacitor at AREF pin

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Sources (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - ADC7 Digital input Disable
.equ	ADC6D		= 6		; 0x40 - ADC6 Digital input Disable
.equ	ADC5D		= 5		; 0x20 - ADC5 Digital input Disable
.equ	ADC4D		= 4		; 0x10 - ADC4 Digital input Disable
.equ	ADC3D		= 3		; 0x08 - ADC3 Digital input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0 Digital input Disable



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR0A bits		------------------------
.equ	RXC0		= 7		; 0x80 - USART Receive Complete
.equ	TXC0		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE0		= 5		; 0x20 - USART Data Register Empty
.equ	FE0		= 4		; 0x10 - Framing Error
.equ	DOR0		= 3		; 0x08 - Data overRun
.equ	UPE0		= 2		; 0x04 - USART Parity Error
.equ	U2X0		= 1		; 0x02 - Double the USART Transmission Speed
.equ	MPCM0		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR0B bits		------------------------
.equ	RXCIE0		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE0		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE0		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
.equ	RXEN0		= 4		; 0x10 - Receiver Enable
.equ	TXEN0		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ02		= 2		; 0x04 - Character Size
.equ	RXB80		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB80		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR0C bits		------------------------
.equ	UMSEL0		= 6		; 0x40 - USART Mode Select
.equ	UPM0_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM00		= 4		;          UPM0 BIT0 position
.equ	USBS0		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ0_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ00		= 1		;          UCSZ0 BIT0 position
.equ	UCPOL0		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL0	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
; ::::  UPM0	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS0	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit




